In [2]:
import pandas as pd
df = pd.DataFrame([[54.2,'a'],[658,'d']],
                  index = list('pq'))
df.columns = df.index
print(df.columns.values)

['p' 'q']

In [2]:
import pandas as pd
df = pd.DataFrame([[18,10,5,11,-2],
                    [2,-2,9,-11,3],
                    [-4,6,-19,2,1],
                    [3,-14,1,-2,8],
                    [-2,2,4,6,13]],
                  index = list('pqrst'),
                    columns = list('abcde'))
df

    a   b   c   d   e
p  18  10   5  11  -2
q   2  -2   9 -11   3
r  -4   6 -19   2   1
s   3 -14   1  -2   8
t  -2   2   4   6  13

In [3]:
new_df = df[df.apply(sum, axis=1) % 2 == 0]
new_df

    a   b   c   d  e
p  18  10   5  11 -2
r  -4   6 -19   2  1
s   3 -14   1  -2  8

In [5]:
df_temp = new_df.copy()
df_temp['m'] = df_temp.apply(lambda row: eval('*'.join(map(str, row))), axis=1)
df_temp

    a   b   c   d  e      m
p  18  10   5  11 -2 -19800
r  -4   6 -19   2  1    912
s   3 -14   1  -2  8    672

In [7]:
import pandas as pd

df = pd.DataFrame([[2,5],
                   [56,20]],
                   index = list('pq'),
                    columns = list('ab'))

def loc(a,b):
    try:
        out = df.loc[a,b]
    except:
        return 0
    return out

def iloc(a,b):
    try:
        out = df.iloc[a,b]
    except:
        return 0
    return out    
        
print( iloc(0,'b') )
print( loc(0,'b') )
print( loc('q','a') )
print( iloc('q','b') )

0
0
56
0

In [9]:
import numpy as np
f = pd.DataFrame({'A' : [1,-4,7],
                   'B' : [-2,5,-8],
                   'C' : [-3,-6,9]},
                   index = list('STU'))
print(df.apply(np.sum, axis = 0).sum())

83

In [10]:
import pandas as pd
df1 = pd.DataFrame({'A': [1,4,7],
                    'B': [2,5,8],
                    'C': [3,6,9]},
                    index = list ('PQR'))
df2 = pd.DataFrame({'A': [1,-4,-7],
                    'B': [-2,5,-8],
                    'C': [-3,-6,9]},
                    index = list ('STU'))
print(df1.sub(df2).count().sum())

0

In [12]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3,4,np.nan,-1],
                   [np.nan, np.nan, np.nan, 5]],
                  columns = list('ABCD'))
print(df.dropna(axis = 1, how = 'all'))

     A    B  D
0  NaN  2.0  0
1  3.0  4.0 -1
2  NaN  NaN  5

In [13]:
import pandas as pd
df = pd.DataFrame([15,12],
                  [33,54],
                  [10,32],
                  index = ['one','two','three'],
                  columns = ['col1', 'col2'])
print(df.filter(regex = 'e$', axis = 0))

TypeError: __init__() got multiple values for argument 'index'

In [14]:
import pandas as pd
df = pd.DataFrame([[15,12],
                   [33,54],
                   [10,32]],
                   columns = list('AB'))
print(df.eval('B-A').median())

21.0

In [15]:
import pandas as pd
df = pd.DataFrame([[15,12], [33,54], 10,32]],
                   index = list('ABC'),
                   columns = list('DE'))
print(df.iloc['B', 'D'])

SyntaxError: closing parenthesis ']' does not match opening parenthesis '(' (2367747984.py, line 2)

In [16]:
import pandas as pd
data1 = pd.DataFrame([[15, 12, -3],
                    [33, 54, 21],
                    [10, 32, 22]],
                    columns = list('ABC'))
data2 = pd.DataFrame([[10, 1, 3],
                    [33, -54, 2],
                    [10, 0.32, 2]],
                    columns = list('DEF'))
print(data1)

print(data2)

print(pd.concat( [data1,data2], axis = 1 ))

    A   B   C
0  15  12  -3
1  33  54  21
2  10  32  22
    D      E  F
0  10   1.00  3
1  33 -54.00  2
2  10   0.32  2
    A   B   C   D      E  F
0  15  12  -3  10   1.00  3
1  33  54  21  33 -54.00  2
2  10  32  22  10   0.32  2

In [17]:
sys = ['s1','s1','s1','s1',
        's2','s2','s2','s2']
net_day = ['d1','d1','d2','d2',
        'd1','d1','d2','d2']
spd = [1.3, 11.4, 5.6, 12.3, 
        6.2, 1.1, 20.0, 8.8]
df = pd.DataFrame({'set_name':sys,
                    'spd_per_day':net_day,
                    'speed':spd})
df

  set_name spd_per_day  speed
0       s1          d1    1.3
1       s1          d1   11.4
2       s1          d2    5.6
3       s1          d2   12.3
4       s2          d1    6.2
5       s2          d1    1.1
6       s2          d2   20.0
7       s2          d2    8.8

In [19]:
# Group by 'set_name' and 'spd_per_day' and calculate the median speed
grouped = df.groupby(['set_name', 'spd_per_day']).median().reset_index()
grouped

  set_name spd_per_day  speed
0       s1          d1   6.35
1       s1          d2   8.95
2       s2          d1   3.65
3       s2          d2  14.40

In [20]:
# Rename the 'speed' column to 'Median'
grouped.rename(columns={'speed': 'Median'}, inplace=True)
grouped

  set_name spd_per_day  Median
0       s1          d1    6.35
1       s1          d2    8.95
2       s2          d1    3.65
3       s2          d2   14.40

In [21]:
# Sort the DataFrame by 'Median' in ascending order
new_df = grouped.sort_values(by='Median').reset_index(drop=True)
new_df

  set_name spd_per_day  Median
0       s2          d1    3.65
1       s1          d1    6.35
2       s1          d2    8.95
3       s2          d2   14.40